0.orig/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    piston
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    liner
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    cylinderHead
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    valveInlet
    {
        type                    uniformFixedValue;
        uniformValue            csvFile;
        nHeaderLine             1;
        refColumn               0;
        componentColumns        (1 2 3);
        separator               " ";
        mergeSeparators         true;
        file                    "<constant>/csv/valveVelocities.csv";
        outOfBounds             repeat;
    }

    valveOutlet
    {
        type                    uniformFixedValue;
        uniformValue            csvFile;
        nHeaderLine             1;
        refColumn               0;
        componentColumns        (4 5 6);
        separator               " ";
        mergeSeparators         true;
        file                    "<constant>/csv/valveVelocities.csv";
        outOfBounds             repeat;
    }

    inlet
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    outlet
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    frontAndBack
    {
        type    empty;
    }
}

// ************************************************************************* //
