0.orig/pointMotionUy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    object      pointMotionUy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    piston
    {
        type    fixedValue;
        value   uniform 0;
    }

    liner
    {
        type            slip;
    }

    cylinderHead
    {
        type    fixedValue;
        value   uniform 0;
    }

    valveInlet
    {
        type    fixedValue;
        value   uniform 0;
    }
  
    valveOutlet
    {
        type    fixedValue;
        value   uniform 0;
    }

    inlet
    {
        type    fixedValue;
        value   uniform 0;
    }

    outlet
    {
        type    fixedValue;
        value   uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
