constant/engineGeometry
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      engineGeometry;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

engineMesh      fvMotionSolver;
conRodLength    0.13;
bore            0.07625;
stroke          0.06;
clearance       0.02;
rpm             1500;
component       y;
diffusivity     quadratic inverseDistance (".*");
motionType	engineAndDynamicMesh;

// ************************************************************************* //
