constant/foam.inp
species
(
    O2
    N2
)
;

reactions
{}
